{
  "all": {
    "third-party-licenses": "Licencje osób trzecich",
    "projects": "Projekty",
    "achievements": "Osiągnięcia",
    "skills": "Umiejętności",
    "chapters": {
      "bio": "O mnie",
      "projects": "Projekty",
      "achievements": "Osiągnięcia",
      "skills": "Umiejętności"
    }
  },
  "index": {
    "header": {
      "name": "Kacper Faber",
      "sub": "Full Stack Developer"
    },
    "content": {
      "bio": {
        "text": "Swoją przygodę z programowaniem zacząłem w styczniu 2017r. .\n<br><br>\nOd tego czasu nauczyłem się wielu ciekawych języków i technologii. \nPoznałem genialny system kontroli wersji Git, bez którego nie wyobrażam sobie pracy.\nZrozumiałem protokoły HTTP oraz WebSocket.\n<br><br>\nPoznałem wiele bibliotek i frameworków takich jak Spring, Ktor, Compose, React, Mithril, Koin oraz systemy służące do kompilacji takie jak Gradle, Maven czy WebPack. Jestem również właścicielem kilku własnych bibliotek opublikowanych na npm, nuget oraz maven.\n<br><br>\nWykonywałem projekty w C#, Java oraz w moim ulubionym - w Kotlinie, oraz projekty w języku TypeScript. Projekty aplikacji webowych, mobilnych oraz tych przeglądarkowych. Aplikacji i bibliotek, które używam w kolejnych moich projektach.\n<br><br>\nW swoich projektach używam testów jednostkowych i integracyjnych, aby mieć pewność o poprawnym działaniu moich programów. A także systemów automatycznego wdrażania i testowania, by zapewnić szybką produkcję projektu poprzez jeden 'git push'.<br><br>\nWszystkie projekty wykonuję jak najlepiej, często ucząc się nowych rzeczy i szukając najbardziej optymalnych rozwiązań. Nie lubię chodzić na skróty i chcę zapewnić użytkownikom taki komfort, jakiego sam bym oczekiwał."
      }
    }
  },
  "__projects": [
    {
      "title": "ChessTasks.com/App",
      "description": "Dostępna pod adresem chesstasks.com.pl aplikacja wieloplatformowa napisana w React i TypeScript, jako aplikacja kliencka do projektu ChessTasks.com/Server. Pozwala na rozwiązywanie zadań szachowych dostarczonych przez serwer i doskonalenie swoich szachowych umiejętności poprzez system rankingu, zaawansowanej wyszukiwarki zadań oraz system interakcji z innymi użytkownikami",
      "url": "https://www.github.com/kacperfaber/chesstasks-app",
      "action": "Ukończono w 2023r.",
      "tags": [
        "React",
        "MUI",
        "TypeScript",
        "Capacitor",
        "Single Page Application",
        "Android",
        "Webpack",
        "CI/CD",
        "Szachy",
        "Zadania szachowe"
      ]
    },
    {
      "title": "ChessTasks.com/Server",
      "description": "Serwer REST API, napisany w języku Kotlin oraz frameworku Ktor dostarczająca zadania szachowe do aplikacji klienckiej ChessTasks.com/App. Pozwala na rozwiązywanie zadań szachowych, system rankingowy, interakcje między użytkownikami, Obsługuje import zadań szachowych z publicznej bazy lichess.org",
      "url": "https://www.github.com/kacperfaber/chesstasks-server",
      "action": "Ukończono w 2023r.",
      "tags": [
        "Kotlin",
        "Ktor",
        "Gradle",
        "REST API",
        "CI/CD",
        "Serwer",
        "Szachy",
        "Zadania szachowe"
      ]
    },
    {
      "title": "CodzienneMotto.pl/App",
      "description": "Aplikacja wieloplatformowa napisana we frameworku Mithril, jako aplikacja kliencka serwera CodzienneMotto.pl/server. Pozwala na tworzenie list codziennych cytatów i udostępnianie ich innym użytkownikom aplikacji. Użytkownik może dołączyć do naszej listy poprzez kod zaproszenia. Użytkownik widzi tylko dzisiejsze motto i elementy które zostały już pokazane wcześniej. Właściciel listy może zarządzać listą, tworzyć cytaty jako elementy tej listy, zarządzać użytkownikami, wysyłać kody do dołączenia, edytować elementy listy. Docelowo właściciel będzie mógł zaplanować cytat na konkretny dzień lub zmienić kolejność [aktualnie to obsługiwane tylko na serwerze]",
      "url": "https://www.github.com/kacperfaber/codziennemotto-pl-app",
      "action": "Ukończono w 2023r. - Nie wdrożono",
      "tags": [
        "Mithril",
        "Kotlin",
        "Webpack",
        "REST API",
        "CI",
        "Single Page Application",
        "Serwer",
        "Lista cytatów"
      ]
    },
    {
      "title": "CodzienneMotto.pl/Server",
      "description": "Serwer REST API napisany we frameworku Spring. Serwer obsługuje aplikacje CodzienneMotto.pl/App. Pozwala na tworzenie list codziennych cytatów, zapraszanie do niej innych użytkowników tej listy poprzez kod dołączenia. Właściciel listy ma możliwość zmiany kolejności cytatów na liście lub zaplanowanie go na konkretny dzień oraz dodanie nowego cytatu. Może również zarządzać użytkownikami dodanymi już do swojej listy.",
      "action": "Ukończono w 2023r. - Nie wdrożono",
      "url": "https://www.github.com/kacperfaber/codziennemotto_pl_server",
      "tags": [
        "Kotlin",
        "Spring",
        "Gradle",
        "REST API",
        "CI",
        "Serwer",
        "Lista cytatów"
      ]
    },
	{
      "title": "chlss",
      "description": "Biblioteka szachową którą napisałem w TypeScript oraz opublikowałem w npm. Ponadto napisałem parę skryptów w Python żeby sprawdzić zgodność wyników z innym działającym programem. Używam jej jako zależności w innym moim projekcie - ChessTasks.com",
      "url": "https://www.github.com/kacperfaber/chlss",
      "action": "Ukończono w 2023r.",
      "tags": [
        "TypeScript",
        "npm",
        "Silnik Szachowy",
        "Jest",
        "Python",
        "CI/CD"
      ]
    },
    {
      "title": "WSL",
      "description": "Framework MVC napisany w języku Kotlin, bazujący na spring pozwalający tworzyć serwery WebSocket. Umożliwia tworzenie aplikacji webowej jako serwera WebSocket, obsługującej wiele endpointów. Jedną z jego największych zalet jest niesamowity system rozszerzeń, dzięki którym użytkownik może w intuicyjny sposób zrobić co tylko chce np. Przetwarzać rezultat zwrócony przez akcję, albo dodać wartość w postaci parametru do tej akcji. Rozszerzenia to adnotacje, które przechodzą z poziomu wyższego czyli np. Możemy dodać roszerzenie do wszystkich akcji kontrolera za pomocą jednego użycia adnotacji. Biblioteka jest dostępna w repozytorium maven, a instrukcja oraz szczegółowa dokumentacja jest dostępna w repozytorium.",
      "action": "Ukończono w 2023r.",
      "url": "https://www.github.com/kacperfaber/wsl",
      "tags": ["Kotlin", "WebSocket", "Spring", "Framework", "JUnit", "Gradle", "Github Packages", "CI/CD"]
    },
	{
      "title": "wulkanowy",
      "description": "Utworzenie nowej funkcjonalności w otwarto-źródłowej aplikacji Android - wulkanowy. Jest to nieoficjalna aplikacja dziennika szkolnego, do której dodałem funkcjonalność nazwaną kalkulatorem ocen. Można było utworzyć kalkulator z ocen z wybranego przedmiotu, lub dodać ten przedmiot do istniejącego kalkulatora. Na ekranie kalkulatora można było dodać ocenę, zmodyfikować istniejącą, zmienić jej wagę czyli generalnie zasymulować co się stanie gdy... Pull-Request został wysłany, narazie bez odpowiedzi.",
      "action": "Zakończono w 2023r.",
      "url": "https://www.github.com/wulkanowy/wulkanowy/pull/2114",
      "tags": [
        "Kotlin",
        "Android",
        "Natywna aplikacja android",
        "MaterialUI",
        "Pull-Request",
        "Kalkulator ocen",
        "Dziennik szkolny"
      ]
    },
    {
      "title": "Spencer.NET",
      "description": "Kontener wstrzykiwania zależności który napisałem w C# w 2021r.",
      "tags": [
        "C#",
        ".NET",
        "NuGet",
        "Inversion of Control",
        "Dependency Injection"
      ],
      "url": "https://www.github.com/kacperfaber/Spencer.NET",
      "action": "Ukończono w 2020r."
    },
    {
      "title": "mithril-sql-presentation",
      "description": "Responsywna strona internetowa napisana w frameworku Mithril oraz TypeScript jako prezentacja szkolna na temat SQL. Poza zwykłym przedstawieniem języka SQL zawiera interaktywne elementy pozwalające utworzyć schemat bazy danych oraz wykonać na niej testowe zapytanie oraz otrzymać jego wyniki w postaci tabeli danych. Żeby móc użyć interaktywnych elementów należy pobrać skrypt PHP z serwerem [Dostępny w repozytorium] i uruchomić go lokalnie, po czym w aplikacji ustawić jego adres. Strona jest dalej dostępna w internecie [Proszę zobaczyć README].",
      "action": "Ukońcozno w 2023r.",
      "url": "https://www.github.com/kacperfaber/mithril-sql-presentation",
      "tags": [
        "TypeScript",
        "Mithril",
        "php",
        "SQL",
        "Bazy danych",
        "Single Page Application"
      ]
    },
    {
      "title": "FaceitAPI",
      "description": "Mój pierwszy projekt opublikowany publicznie. Jest to wrapper API, obsługujący HTTP API do strony faceit.com. Po kliknięciu, zostaną państwo przekierowani do repozytorium zawierającego przykład użycia biblioteki, a także zawierającego link do pakietu na NuGet.com",
      "action": "Opublikowano w 2019r.",
      "url": "https://www.github.com/kacperfaber/FaceitAPI.Samples",
      "tags": [
        "C#",
        "HTTP",
        "API Wrapper",
        "OAuth2"
      ]
    },
    {
      "title": "coronavirus-daily-report",
      "description": "Serwer utworzony w 2021r., który utworzyłem dla własnego użytku. Serwer zapewniał codzienne raporty w postaci maili na temat sytuacji pandemicznej w Polsce i na świecie. Był to mój pierwszy pełny projekt w języku Kotlin. Serwer został już wyłączony.",
      "action": "Utworzono w 2021r.",
      "url": "https://www.github.com/kacperfaber/coronavirus-daily-report",
      "tags": [
        "Kotlin",
        "Maven",
        "Hibernate",
        "SMTP",
        "Thymeleaf",
        "covid-19",
        "Usługa w tle",
        "Codzienne raporty",
        "Newsletter"
      ]
    },

    {
      "title": "SandstoneLauncher",
      "description": "Projekt launchera do gry minecraft, który rozpocząłem w 2019r. i niedługo potem ukończyłem pisać sekcje odpowiedzialną za pobieranie i instalowanie gry, oraz za jej odpowiednie uruchomienie. W 2023r. utworzyłem tam podprojekt odpowiedzialny za obsługę biblioteki poprzez CLI. W 2023r. rozpocząłem pisanie interfejsu użytkownika w Kotlin oraz Compose, ale nie zostało to jeszcze skończone.",
      "action": "2019r. - W trakcie",
      "url": "https://www.github.com/kacperfaber/SandstoneLauncher",
      "tags": [
        "C#",
        "Biblioteka",
        "Minecraft",
        "CLI",
        "argparse"
      ]
    },
    {
      "title": "captcha-api",
      "description": "Napisana z braku ciekawszych zajęć bardzo prosta, trywialna aplikacja serwera napisana w języku Python. Używa frameworka Flask, pozwala na generowanie obrazków captcha.",
      "action": "Ukończono w 2022r.",
      "url": "https://www.github.com/kacperfaber/captcha-api",
      "tags": [
        "Python",
        "Flask",
        "REST API",
        "Generator captcha"
      ]
    },
    {
      "title": "TeamsHelper",
      "description": "Serwer napisany na własny użytek w języku C#, synchronizujący kalendarz aplikacji Teams z kalendarzem google. Serwer raz na jakiś czas używając tokenów dostępu pobiera wszystkie zaplanowane wydarzenia z kalendarza Teams, oraz przepisuje je do kalendarza google. W celu wyeliminowania duplikatów, używa metadanych w kalendarzu google. Używałem tego programu na czas nauki zdalnej. Serwer został wyłączony.",
      "action": "Ukończono w 2020r.",
      "url": "https://github.com/kacperfaber/TeamsHelper",
      "tags": [
        "C#",
        "OAuth2",
        "Serwer",
        "Kalendarz google",
        "Teams"
      ]
    },
    {
      "title": "SpotifyShuffler",
      "description": "Aplikacja działająca po stronie serwera. Wyświetla interfejs użytkownika w formie widoku zwracanych z kontrolera, w schemacie MVC. Umożliwiała użytkownikowi zalogowanie się za pośrednictwem Spotify, wyświetlała mu jego playlisty i pozwalała posortować wybraną w sposób losowy. Przed wysłaniem zmian do spotify, pozwala użytkownikowi zatwierdzić lub losować kolejność ponownie. W celu optymalizacji wysyła więcej piosenek w jednym zapytaniu",
      "action": "Ukończono w 2020r.",
      "url": "https://github.com/kacperfaber/SpotifyShuffler",
      "tags": [
        "C#",
        "Spotify",
        "OAuth2"
      ]
    },
    {
      "title": "6obcy-client",
      "description": "Aplikacja napisana w języku Python, jako aplikacja kliencka czatu internetowego zgodnie z protokołem który sam udokumentowałem przy użyciu devtoolsów. Czat jest osadzony w terminalu, możemy go obsługiwać komendami np. aby połączyć się należy komendy /connect. Jedynym oknem w tej aplikacji jest okno weryfikacji captcha, które może się pojawić przy pierwszym połączeniu. W celu optymalnego używania strumienia wyjścia program używa flush oraz znaków specjalnych do odświeżania linijek, które zostały już zapełnione..",
      "action": "Ukończono w 2021r.",
      "url": "https://www.github.com/kacperfaber/6obcy-client-python",
      "tags": [
        "Python",
        "Tkinter",
        "WebSocket",
        "venv",
        "Klient czatu internetowego"
      ]
    },
    {
      "title": "kacperfaber-app",
      "description": "Responsywna strona internertowa napisana w React. Pełni funkcję ciekawie wyglądającego portfolio, wyświetlające listę moich projektów, osiągnieć a także danych kontaktowych. Jest dostępna pod adresem kacperfaber.pl",
      "url": "https://www.github.com/kacperfaber/kacperfaber-app",
      "action": "Ukończono w 2023r.",
      "tags": [
        "TypeScript",
        "React",
        "WebPack",
        "Portfolio",
        "Single Page Application",
        "Landing Page"
      ]
    },
    {
      "title": "kacperfaber-server",
      "description": "Projekt serwera dla strony kacperfaber.pl napisany w języku Kotlin oraz frameworku Spring, w której administrator strony korzystający z dedykowanej aplikacji mógłby zmienić listę projektów widocznych na stronie, zmodyfikować je, zmienić ich kolejność a także odpowiadać na wiadomości wysłane poprzez specjalny formularz kontaktowy dostępny na stronie. Aktualnie nie ukończono i strona działa bez serwera API.",
      "url": "https://www.github.com/kacperfaber/kacperfaber-server",
      "action": "2023r. - W trakcie",
      "tags": [
        "Kotlin",
        "Spring",
        "REST API",
        "Portfolio"
      ]
    },
    {
      "title": "kacperfaber-admin-app",
      "description": "Napisana w React aplikacja przeznaczona dla administratora strony kacperfaber.pl, w której mógłby on zarządząć projektami, zmieniać ich kolejność, dodawać nowe oraz modyfikować istniejącę. Aktualnie nie ukończono.",
      "url": "https://www.github.com/kacperfaber/kacperfaber-admin-app",
      "action": "2023r. - W trakcie",
      "tags": [
        "React",
        "TypeScript",
        "MUI",
        "data-grid",
        "acp",
        "Single Page Application",
        "Panel administratora"
      ]
    }
  ],
  "__skills": [
    {
      "title": "Języki programowania",
      "description": "Płynnie poruszam się w językach Kotlin, Java oraz JavaScript/TypeScript, kiedyś również w C#. W projektach używam wielowątkowości, by zapewnić płynność działania.",
      "action": "Od 2021r.",
      "tags": ["Kotlin", "Java", "TypeScript", "JavaScript", "C#"]
    },

    {
      "title": "Inne języki programowania",
      "description": "Znam również kilka innych języków, w których nie piszę na codzień. Są to między innymi Python",
      "action": "Od 2018r.",
      "tags": ["Python"]
    },

    {
      "title": "Bazy danych",
      "description": "Płynnie posługuję się językiem SQL. Pracowałem na kilku frameworkach bazo-danowych zaczynając od EntityFramework, przez Hibernate i kończąc na Room, spring-data-jpa a także ExposedSQL. Używałem baz MySQL, SQlite oraz baz tzw. \"InMemory\". Potrafię również obsługiwać narzędzie phpmyadmin.",
      "action": "Od 2020r.",
      "tags": ["SQL", "PhpMyAdmin", "EntityFramework", "Hibernate", "Spring-Data-Jpa", "Room", "Exposed"]
    },

    {
      "title": "Backend",
      "description": "Utworzyłem wiele aplikacji webowych, w większości są to serwery API. Znam popularne frameworki takie jak Spring czy Ktor, wcześniej zajmowałem się AspNetCore.",
      "action": "Od 2020r.",
      "tags": ["Spring", "Ktor", "AspNetCore", "CodzienneMotto.pl/Server", "ChessTasks.com/Server", "coronavirus-daily-report", "SpotifyShuffler"]
    },

    {
      "title": "Frontend",
      "description": "Wykonałem kilka aplikacji wieloplatformowych takich jak ChessTasks.com/App czy CodzienneMotto.pl/App. Mam doświadczenie z frameworkami takimi jak Mithril czy React. Używam również capacitora, do utworzenia aplikacji wieloplatformowej na podstawie strony internetowej, Preferuję pisanie w języku TypeScript. W projektach używam systemu webpack, żeby dostosować kompilację, dodać zasoby, zdefiniować wartości podczas kompilacji czy utworzyć pojedynczy plik wynikowy.",
      "action": "Od 2023r.",
      "tags": ["React", "Mithril", "Compose", "Capacitor", "WebPack", "TypeScript", "JavaScript"]
    },

    {
      "title": "Biblioteki",
      "description": "Napisałem kilka bibliotek i frameworków opublikowanych w repozytoriach npm, maven czy NuGet. Są to między innymi `chlss` czyli silnik szachowy. `WSL` czyli framework MVC pozwalający tworzyć serwery WebSocket czy kontener dependency-injection: Spencer.NET.",
      "action": "Od 2019r.",
      "tags": ["Npm", "Maven", "NuGet", "wsl", "chlss", "Spencer.NET"]
    },

    {
      "title": "Zarządzanie serwerem oraz domeną",
      "description": "Mam doświadczenie z zarządzeniem serwerem linux poprzez SSH, a także z tworzeniem domen internetowych. Sprawnie tworzę serwisy a także zarządzam serwerem Linux poprzez terminal. Potrafię skonfigurować serwer DNS oraz NGINX. Bez trudności instaluję certyfikaty SSL, jestem również właścicielem domeny mailowej zabezpieczoną przy użyciu DKIM oraz SPF, którą sam skonfigurowałem.",
      "action": "Od 2020r.",
      "tags": ["DNS", "nginx", "DNS", "postfix", "opendkim", "DKIM", "SPF"]
    },

    {
      "title": "Systemy kompilacji",
      "description": "Obsługuję systemy służące do kompilacji takie jak Gradle, Maven czy WebPack. Kiedyś bawiłem się również trochę w CMake.",
      "tags": ["Gradle", "Maven", "WebPack", "npm", "CMake"]
    },

    {
      "title": "System kontroli wersji",
      "description": "Pracuję z systemem kontroli wersji GIT od 2019r. Od tego czasu używam GITa we wszystkich moich projektach.",
      "action": "Od 2019r.",
      "tags": ["GIT", "VCS", "Github"]
    },

    {
      "title": "Protokoły sieciowe",
      "description": "Bardzo dobrze znam protokoły sieciowe takie jak HTTP, WebSocket czy SMTP. Protokół HTTP poznałem bardzo dobrze przy pisaniu licznych serwerów API, oraz przy używaniu zewnętrznych serwerów API. Protokół WebSocket, przy okazji pisania aplikacji klienckiej dla czatu internetwego zewnętrznej firmy, a także przy pisaniu biblioteki WSL. Ponadto mogę pochwalić się doświadczeniem z protokołem dostępu do danych OAuth2.",
      "action": "Od 2019r.",
      "tags": ["HTTP", "WebSocket", "SMTP", "wsl"]
    },

    {
      "title": "Testy",
      "description": "Moje projecty są dobrze sprawdzone przy użyciu testów jednostkowych i integracyjnych. Znam popularne frameworki takie jak JUnit, jest czy xUnit. Potrafię wykonywać Mocki oraz obsługuję rozszerzenia do testowania z frameworka Spring. W aplikacjach webowych testuję również tzw. \"Warstwę sieci\" czyli jak działają konkretne endpointy.",
      "action": "Od 2019r.",
      "tags": ["JUnit", "xUnit", "Jest", "Mock", "mockito", "spyOn", "Spring Test"]
    },

    {
      "title": "CI/CD",
      "description": "W moich projektach wykorzystuję ciągłe testowanie i wdrażanie.",
      "action": "Od 2023r.",
      "tags": ["CI", "CD", "Github Actions", "Workflows", "chlss", "wsl", "ChessTasks.com/Server", "ChessTasks.com/App"]
    },

    {
      "title": "Notacje danych",
      "description": "Znam popularnę notację danych takie jak JSON czy XML. Korzystam również z JsonPath.",
      "action": "Od 2019r.",
      "tags": ["JSON", "XML", "Java Script Object Notation", "JsonPath"]
    }
  ]
}
